semestr1/logika/23.11.20-w.md

# Table of Contents

1.  [treśc nazwy kwadrat](#org5812ee9)
2.  [treść leksykalna](#org1e997eb)
3.  [cechy kensekutywne](#orgf3cbfab)
4.  [ostrosć nazwy](#org9882a54)
5.  [wyrazistość nazwy](#orgfa06d7a)
6.  [jeżeli nazwa jest ostra i wyraźna, to jest terminem](#org21134c0)
7.  [supozycje](#org34707df)
8.  [język 1 stopnia](#org5a19c4b)
9.  [język 2 stopnia](#orge5e0a2e)
10. [nazwy prywatywne](#orge735d29)
11. [nazwy nieprywatywne](#org1f2d7f3)
12. [relacje między zakresami nazw](#org08ce884)
    1.  [zamienności](#org6a3cb20)
    2.  [podrzedności](#org5285e31)
    3.  [sprzeczności](#org6d3bfbc)
    4.  [niezależności](#org363c659)
    5.  [przeciwieństwa](#orga4048b1)
    6.  [podprzeciwieństwa](#org9f21edd)
    7.  [?](#org3ecaba9)
13. [Klasyczny rachunek nazw](#orga5771d8)
    1.  [rodzaje zdań kategorycznych(orzekających)](#org55e8480)



<a id="org5812ee9"></a>

# treśc nazwy kwadrat

-   4 równe boki


<a id="org1e997eb"></a>

# treść leksykalna

-   cechy: charakterystyczna, konstytutywna


<a id="orgf3cbfab"></a>

# cechy kensekutywne


<a id="org9882a54"></a>

# ostrosć nazwy

-   wiemy do jakiego desygnatu możemy tę nazwę odniesć, wiemy do jakiego zakresu desygnaty należą bądź nie należą
-   w jęz pot np pies, dziecko


<a id="orgfa06d7a"></a>

# wyrazistość nazwy

-   treść jest wyraźna kiedy wszystkie obiekty, do których nazwa się odnosi maja tę samą cechę
-   np obiekty matematyczne mają wyraziste nazwy

-   nazwy mają intuicyjne znaczenie jeżeli mozna wskazać ich desygnaty nie znając cech konstytutywnych


<a id="org21134c0"></a>

# jeżeli nazwa jest ostra i wyraźna, to jest terminem


<a id="org34707df"></a>

# supozycje

-   naturalna - odnosi nazwę do wszystkich jej desygnatów np człowiek jest śmiertelny
-   przedmiotowa - odnosi się do jednego ze swoich desygnatów np widzę człowieka
-   materialna - nazwa odnosi sie do samej siebie, nazwy używamy w supozycji materialnej kiedy obiektem, do którego nazwa się odnosi jest słowo, nazwa sama w sobie
-   formalna (czasami wymieniana) -  w tym użyciu nazwa oznacza gatunek


<a id="org5a19c4b"></a>

# język 1 stopnia

-   język przedmiotowy


<a id="orge5e0a2e"></a>

# język 2 stopnia

-   metajęzyk
-   język mówiący o języku (nazwy w supozycji materialnej)

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


</table>


<a id="orge735d29"></a>

# nazwy prywatywne

-   np


<a id="org1f2d7f3"></a>

# nazwy nieprywatywne

-   np nieprzyjaciel


<a id="org08ce884"></a>

# relacje między zakresami nazw

-   zakres nazwy tworza desygnaty nazwy
-   zakres nazwy uniwersalnej


<a id="org6a3cb20"></a>

## zamienności

-   synonimiczność


<a id="org5285e31"></a>

## podrzedności

-   {zwierzę, pies} ; {przedmioty, laptop}


<a id="org6d3bfbc"></a>

## sprzeczności

-   {pies, nie pies} ; {człowiek, nie człowiek}


<a id="org363c659"></a>

## niezależności

-   {student, rowerzysta} ; {}


<a id="orga4048b1"></a>

## przeciwieństwa

-   {zdania w krz, zdania normatywne}


<a id="org9f21edd"></a>

## podprzeciwieństwa


<a id="org3ecaba9"></a>

## ?

-   {drzewo, nie sosna} ; {zwierzę, nie pies}


<a id="orga5771d8"></a>

# Klasyczny rachunek nazw

-   związki pomiędzy zdaniami kategorycznymi
-   wnioskowania pośrednie i bezpośrednie (sylogizm)


<a id="org55e8480"></a>

## rodzaje zdań kategorycznych(orzekających)

-   S, P - zmienne nazwowe; a, e, i, o - funktor
-   **S a P:** każde S jest P - ogólnotwierdzące
-   **S e P:** żadne S nie jest P - ogólnoprzeczące
-   **S i P:** niektóre S są P - szczególnotwierdzące
-   **S o P:** niektóre S nie są P - szczególnoprzeczące

